<h2> Part 1: Set up </h2>

In [1]:
import pandas as pd

In [7]:
import os

In [70]:
import math

In [ ]:
import numpy as np

In [ ]:
# Below, identify and name the dataset you're using. this one is already in jupyter. 
# Can also do: data = pd.read_csv("URL to dataset") . Can sub csv with json or xls

In [8]:
data = pd.read_csv(os.path.join('mls-salaries-2017.csv'))

In [ ]:
#data.head gives top 5 rows of data

<h2> Part 2: Check Data and Review Position counts & Salaries </h2>

In [11]:
print data.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M      1912500               2297000.00
1  ATL   Ambrose      Mikey        D        65625                 65625.00
2  ATL      Asad      Yamil        M       150000                150000.00
3  ATL     Bloom       Mark        D        99225                106573.89
4  ATL  Carleton     Andrew        F        65000                 77400.00

In [14]:
for x in data.columns.values:
    print x

club
last_name
first_name
position
base_salary
guaranteed_compensation

In [15]:
print data.head(2)

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M      1912500                  2297000
1  ATL   Ambrose      Mikey        D        65625                    65625

In [16]:
#how many rows in dataset
print len(data)

616

In [46]:
# Get the Avg of column 'base_salary' given that the club is ATL
# Parameters (if ==ATL) come BEFORE value set (base salary)
print data[ data.club=="ATL" ].base_salary.mean()

259213.420645

In [69]:
salary = round(data.base_salary,2)

TypeError: cannot convert the series to <type 'float'>

In [84]:
#Label and count how many midfielders there are
print ("Midfield")

mcnt = data[ data.position=="M" ].position.count()
print (mcnt)
# Define average salary of midfielders.
m_sal = data[ data.position=="M" ].base_salary.mean()
# Round answer to 2 decimals
msal_avg = round(m_sal,2)
print msal_avg

Midfield
212
376106.22

In [85]:
#Same as above, for Defense
print ("Defense")
dcnt = data[ data.position=="D" ].position.count()
print (dcnt)
# Define average salary of defenders
d_sal = data[ data.position=="D" ].base_salary.mean()
# Define answer rounded to 2 decimals
dsal_avg = round(d_sal,2)
print dsal_avg

Defense
185
166574.09

In [86]:
# Again for Forwards
print ("Forward")
fcnt = data[ data.position=="F" ].position.count()
print (fcnt)
# Define average salary of Forwards
f_sal = data[ data.position=="F" ].base_salary.mean()
# Round answer to 2 decimals
fsal_avg = round(f_sal,2)
print fsal_avg

Forward
109
489588.6

In [91]:
# Consolidate and Reorder
print ("Defense")
print (dcnt)
print dsal_avg
print ("Midfield")
print mcnt
print msal_avg
print ("Forward")
print fcnt
print fsal_avg

Defense
185
166574.09
Midfield
212
376106.22
Forward
109
489588.6

<h1> Part 3: Breakdown Counts & Salaries by Club! </h2>

<h3> Atlanta </h3>

In [148]:
#Total players
atl_cnt = data[ data.club=="ATL"].base_salary.count()
print atl_cnt

31

In [149]:
# Define ATL team
atl = data.club=="ATL"
# Total players
atl_tot = data[atl].position.count()
print "Total Players"
print atl_tot

Total Players
31

In [150]:
# ATL Salaries
# Find max and min salaries
atl_maxsal = data[atl].base_salary.max()
atl_minsal = data[atl].base_salary.min()
# Find average salary and round to hundreds
atl_avg = data[atl].base_salary.mean()
atl_avgsal = round(atl_avg,2)
print atl_avgsal
print atl_maxsal
print atl_minsal

259213.42
1912500.0
53000.0

<h3> NYCFC </h3>

In [151]:
#Total players
nyc_cnt = data[ data.club=="NYCFC"].base_salary.count()
print nyc_cnt

28

In [152]:
# Define NYC team
nyc = data.club=="NYCFC"
# Total players
nyc_tot = data[nyc].position.count()
print "Total Players"
print nyc_tot

Total Players
28

In [153]:
# NYC Salaries
# Find max and min salaries
nyc_maxsal = data[nyc].base_salary.max()
nyc_minsal = data[nyc].base_salary.min()
# Find average salary and round to hundreds
nyc_avg = data[nyc].base_salary.mean()
nyc_avgsal = round(nyc_avg,2)
print nyc_avgsal
print nyc_maxsal
print nyc_minsal

620375.92
5610000.0
52999.92

<h2> ATL vs NYCFC </h2>

In [154]:
# Comparing personelle
print atl_tot
print nyc_cnt

31
28

In [184]:
atld_cnt = data[data.club=="ATL" and data.position=="D"].base_salary.sum()

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [155]:
# Comparing Salaries
print "Average Salary"
print atl_avgsal
print nyc_avgsal

print "Highest Salary"
print atl_maxsal
print nyc_maxsal
print "Lowest Salary"
print atl_minsal
print nyc_minsal

Average Salary
259213.42
620375.92
Highest Salary
1912500.0
5610000.0
Lowest Salary
53000.0
52999.92

In [190]:
print data['club'].isnull().sum()
print len(data) - len(data['club'].dropna())

2

AttributeError: 'Series' object has no attribute 'delna'

In [189]:
print data

    club       last_name    first_name position  base_salary  \
0    ATL         Almiron        Miguel        M   1912500.00
1    ATL         Ambrose         Mikey        D     65625.00
2    ATL            Asad         Yamil        M    150000.00
3    ATL           Bloom          Mark        D     99225.00
4    ATL        Carleton        Andrew        F     65000.00
5    ATL         Carmona        Carlos        M    675000.00
6    ATL           Garza          Greg        D    150000.00
7    ATL  Gonzalez Pirez       Leandro        D    250008.00
8    ATL          Goslin         Chris        M     70000.00
9    ATL         Gressel        Julian        M     75000.00
10   ATL           Heath      Harrison        M     66150.00
11   ATL           Jones       Kenwyne        F    390000.00
12   ATL            Kann          Alec       GK     77004.00
13   ATL           Kratz         Kevin        M    150000.00
14   ATL     Larentowicz          Jeff        M    175008.00
15   ATL            Loyd          Zach        D     85008.00
16   ATL        Martinez         Josef        F    924000.00
17   ATL          McCann         Chris        M    540000.00
18   ATL           Mears        Tyrone        D    183756.00
19   ATL    Oblitey Otoo       Jeffrey      M-F     53000.00
20   ATL       Parkhurst       Michael        D    325008.00
21   ATL        Peterson         Jacob        F    165300.00
22   ATL         Reynish          Kyle       GK     65004.00
23   ATL        Robinson         Miles        D    125000.04
24   ATL          Rochez         Bryan        F    200000.00
25   ATL        Tambakis     Alexander       GK     65004.00
26   ATL         Vazquez       Brandon        F    100008.00
27   ATL        Villalba        Hector        F    663000.00
28   ATL          Walkes         Anton        D     53004.00
29   ATL  Wheeler-Omiunu        Andrew        M     53004.00
..   ...             ...           ...      ...          ...
586  VAN         de Jong        Marcel      D-M    140000.00
587  VAN            Dean     Christian        D    121000.00
588  VAN           Edgar         David        D    175000.00
589  VAN          Flores         Deybi        M     66000.00
590  VAN          Froese         Kianz        M     69300.00
591  VAN           Greig          Kyle        F     65004.00
592  VAN          Harvey        Jordan        D    180000.00
593  VAN         Hurtado          Erik      F/M    125000.00
594  VAN        Jacobson        Andrew        M    150000.00
595  VAN            Laba        Matias        M    725000.00
596  VAN           Levis         Brett        D     65000.00
597  VAN        McKendry           Ben        M     65000.00
598  VAN        Mezquida       Nicolas      M-F    120000.00
599  VAN         Montero         Fredy        F   1400000.04
600  VAN       Nerwinski          Jake        D     65004.00
601  VAN          Ousted         David       GK    360000.00
602  VAN          Parker           Tim        D     80850.00
603  VAN           Reyna         Yordy      M-F    440000.04
604  VAN          Richey       Spencer       GK     65004.00
605  VAN         Rosales         Mauro        M     65004.00
606  VAN          Seiler          Cole        D     54075.00
607  VAN            Shea          Brek      M-D    625000.00
608  VAN          Tchani          Tony        M    275000.00
609  VAN         Techera      Cristian        M    352000.00
610  VAN         Teibert       Russell        M    126500.00
611  VAN        Tornaghi         Paolo       GK     80000.00
612  VAN          Waston       Kendall        D    350000.00
613  VAN        Williams       Sheanon        D    175000.00
614  NaN         Babouli            Mo        F     54075.00
615  NaN          Ramajo  David Mateos        D    420000.00

     guaranteed_compensation
0                 2297000.00
1                   65625.00
2                  150000.00
3                  106573.89
4                   77400.00
5                  725000.00
6                  150000.00
7                  285008.00
8                   74000.00
9                   93750.00
10                  66150.00
11                 413333.33
12                  77004.00
13                 164250.00
14                 175008.00
15                  85008.00
16                1041310.00
17                 568000.00
18                 183756.00
19                  53000.00
20                 325008.00
21                 165300.00
22                  65004.00
23                 195000.04
24                 279500.00
25                  65004.00
26                 120008.00
27                 770750.00
28                  53004.00
29                  53004.00
..                       ...
586                140000.00
587                202000.00
588                183833.33
589                 71885.00
590                 73800.00
591                 66849.00
592                180000.00
593                131250.00
594                175000.00
595                885500.00
596                 67500.00
597                 65000.00
598                120000.00
599               1800000.04
600                 65004.00
601                378933.33
602                 99600.00
603                533700.04
604                 65004.00
605                 65004.00
606                 54075.00
607                670000.00
608                308333.33
609                377000.00
610                194000.00
611                 80000.00
612                368125.00
613                184000.00
614                 54075.00
615                453333.33

[616 rows x 6 columns]